Revit 2027 API
ComputationDataFor3DPathSet Properties
The ComputationDataFor3DPathSet type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
TerminationOrientationAtEnd
Identifies the orientation of the termination's (e.g. hook, crank) plane at the end of the bar with respect to the orientation of the last curve and the termination plane normal.
Only two values are permitted:
Value = Right: The termination is on your right as you stand at the end of the bar, with the bar behind you, taking the termination's normal as "up."
Value = Left: The termination is on your left as you stand at the end of the bar, with the bar behind you, taking the termination's normal as "up."
The default value is Left.
TerminationOrientationAtStart
Identifies the orientation of the termination's (e.g. hook, crank) plane at the start of the bar with respect to the orientation of the first curve and the termination plane normal.
Only two values are permitted:
Value = Right: The termination is on your right as you stand at the end of the bar, with the bar behind you, taking the termination's normal as "up."
Value = Left: The termination is on your left as you stand at the end of the bar, with the bar behind you, taking the termination's normal as "up."
The default value is Left.
TerminationRotationAngleAtEnd
Identifies the termination's (e.g. hook, crank) out of plane rotation angle (in radians) at the end of bar.
The default value is 0.
TerminationRotationAngleAtStart
Identifies the termination's (e.g. hook, crank) out of plane rotation angle (in radians) at the start of bar.
The default value is 0.
Top
See Also
Reference
ComputationDataFor3DPathSet Class
Autodesk.Revit.DB.Structure Namespace